packages/pyOFTools/pyoftools-0.2.0.tar.gz/pyoftools-0.2.0/tests/integration/cube/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    topWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    leftWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    rightWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    bottomWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    frontWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    backWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

}


// ************************************************************************* //
