packages/pyOFTools/pyoftools-0.2.0.tar.gz/pyoftools-0.2.0/tests/integration/cube/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

restore0Dir

runApplication blockMesh

#------------------------------------------------------------------------------
