packages/pyOFTools/pyoftools-0.2.0.tar.gz/pyoftools-0.2.0/tests/integration/cube/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1.0;

vertices
(
    (-0.25 -0.25 -0.25)
    (0.25 -0.25 -0.25)
    (0.25 0.25 -0.25)
    (-0.25 0.25 -0.25)
    (-0.25 -0.25 0.25)
    (0.25 -0.25 0.25)
    (0.25 0.25 0.25)
    (-0.25 0.25 0.25)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (10 10 10) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    topWall
    {
        type wall;
        faces
        (
            (3 7 6 2)
        );
    }

    leftWall
    {
        type wall;
        faces
        (
            (0 4 7 3)
        );
    }

    rightWall
    {
        type wall;
        faces
        (
            (2 6 5 1)
        );
    }
    bottomWall
    {
        type wall;
        faces
        (


            (1 5 4 0)
        );
    }
    frontWall
    {
        type wall;
        faces
        (
            (0 3 2 1)
        );
    }

    backWall
    {
        type wall;
        faces
        (
            (4 5 6 7)
        );
    }
);


// ************************************************************************* //
